const Badboy = require('../events');
const {MessageType} = require('@adiwajshing/baileys');
const GM = "it sends good morning message"
const GN = "it sends good night message"
const Config = require('../config');



if (Config.WORKTYPE == 'private') {
Badboy.addCommand({pattern: 'gm', fromMe: true, deleteCommand: true, desc: GM,}, (async (message, match) => {

    var r_text = new Array ();

    r_text[1] = "☞⍤───★᭄✮͚🙊─⃤̸᭄̂̇✾̋ ⍤⃝☘️😘●͙͙͙͙͙͙█❁ཻ͜͡❀͙͙͙͙͙͙͙͙͙͙͝ ᭄ ❥᭄⃞⃝⃟⃟⃞⃝★────✌️☺️✦⃟🍀⃝🍏⃤💙⃝ꪶ➤ཻ⃝⃘̉̉̉̉̉̉⃝★᭄❥͜͡⃝ᶫᵒᵛᵉ⃝➤⃟̱̱̱̱̄̄̄̄😊
*ගුම්මෝනිම්❁͜͡❁ཻ͜͡😋💝☞🥺➳̶☞̱̱̱̱̱̱̱̱̱̄̄̄̄̄̄̄̄̄̄̄➸⃟̗̗̗̗̗̗̗̗̗̗̗̗̀̀̀̀̀̀̀̀̀̀̀̀̀⃟ ⃟❖❁⃝❤️➸⃟̗̗̗̗̗̗̗̗̗̗̗̗̗̗̀̀̀̀̀̀̀̀̀̀̀̀̀❁͡ මැනික●͙ල"හ්᭄●͙͙͙͙͙❁⃝➸⃟̗̗̗̗̗̗̗̗̗̗̗̗̗̗̀̀̀̀̀̀̀̀̀̀̀̀̀❁ཻ͜͡  බුදුසරණයිꗶ❥ ⃝⃘η̶̩̥̩̥̩̥̩̥̩̥̩̥̩̥̩͓̩̬🌸─⃝►ꗶ❥ ⃝⃘η̶̩̥̩̥̩̥̩̥̩̥̩̥̩̥̩͓̩̬🌸─⃝»͓̽☞̱̱̱̱̱̱̱̱̱̄̄̄̄̄̄̄̄̄̄̄➸⃟̗̗̗̗̗̗̗̗̗̗̀̀̀̀̀̀̀̀̀̀̀̀̀ දෙව්පිහිටයිꗶ❥ ⃝⃘η̶̩̥̩̥̩̥̩̥̩̥̩̥̩̥̩͓̩̬🌸─⃝►ꗶ❥ ⃝⃘η̶̩̥̩̥̩̥̩̥̩̥̩̥̩̥̩͓̩̬🌸─⃝»͓̽☞̱̱̱̱̱̱̱̱̱̄̄̄̄̄̄̄̄̄̄̄➸⃟̗̗̗̗̗̗̗̗̗̗̗̗̀̀̀̀̀̀̀̀̀̀̀̀̀⃟ ⃟❖❁⃝➸⃟̗̗̗̗̗̗̗̗̗̗̗̗̗̗̀̀̀̀̀̀̀̀̀̀̀̀̀❁͜͡🙏😘 සම්මාසම්බුදු❁ཻ͜͡සරනයි😋💝☞
";
    r_text[2] ="💫🌸💫🌸🅶🅾🅾🅳 🅼🅾🆁🅽🅸🅽🅶🌹⃝✥⃟☺️᭄ꦿ *ගුඩ් මොනිම̸්̿̿͐❤̻̻̻̻̻̻̻̻̻͐͐͐̿̿̿̿༄༹༹༹༴༴⃟⃫͎͎͎͎͎͎͇͇͇͇͇͇͇̳̳̳̿̿̿̿̿̿❤️⃟✦⃝̮̮̮̯̯̯😌 සුභ උදෑසනක්❤️⃟⃟◍̸̸̸̸̣̣̣❀❤̐̐̐̐̐⇝⃟̗̗̗̗̗̗̗̗̗̗̖̖̋̋̋̋̋̋̋̋̋̋̋̏̏💔̩̩̭̭̭̭̭බුදු සරණයි🙃⃝⃟۝᭄̊̊࿔࿓ තෙරුවන් සරණයි🍃⃟✦⃝🌼᭄᭄᭄̊̊̊̊̊̊࿔";
    r_text[3] ="🍃𝙶𝚘𝚘𝚍 🌻𝚖𝚘𝚛𝚗𝚒𝚗𝚐 🥰";
    r_text[4] ="🍀𝗚𝗼𝗼𝗱 😘𝗺𝗼𝗿𝗻𝗶𝗻𝗴 🌸";
    r_text[5] ="🌻𝓖𝓸𝓸𝓭 𝓶𝓸𝓻𝓷𝓲𝓷𝓰 💞";
    r_text[6] ="🌼🅖🅞🅞🅓 🅜🅞🅡🅝🅘🅝🅖 🐶";
    r_text[7] ="🍃Ⓖⓞⓞⓓ 🌈ⓜⓞⓡⓝⓘⓝⓖ 🥰";
  

    var i = Math.floor(8*Math.random())

    await message.client.sendMessage(
        message.jid,(r_text[i]), MessageType.text);

    }));


Badboy.addCommand({pattern: 'gn', fromMe: true, deleteCommand: true, desc: GN,}, (async (message, match) => {

        var r_text = new Array ();
    
        r_text[1] = "🥺➳̶☞̱̱̱̱̱̱̱̱̱̄̄̄̄̄̄̄̄̄̄̄➸⃟̗̗̗̗̗̗̗̗̗̗̗̗̀̀̀̀̀̀̀̀̀̀̀̀̀⃟ ⃟❖❁⃝❤️➸⃟̗̗̗̗̀̀̀̀̀̀̀̀̀̀̀̀̀ ❤̋҉̋⃢**➸⃟̗̗̗̗̗̗̗̗̗̗̗̗̗̗̀̀̀̀̀̀̀̀̀̀̀̀̀🌺⍤⃝───ගුඩ් නයිට්✺⃘̶̶۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟̊̊̊̊̊̊͜͡?❥⃢❀͙͙͙͙͙͙͙̽̽̽̽̽̽̽̽᳑̽☢︎︎༒︎✺⃘̶̶۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟̊̊̊̊̊̊͜͡ ~      බුදු සරනයි🙏🙏🙏🙏🌺 පරිස්සමින් ❤️ ◎⃝»̶̶͓͓͓̽̽̽❁͜͡❁ཻ͜͡💝☞ඉන්න➳̶☞̱̱̱̱̱̱̱̱̱̄̄̄̄̄̄̄̄̄̄̄➸⃟̗̗̗̗̗̗̗̗̗̗̗̗̀̀̀̀̀̀̀̀̀̀̀̀̀⃟ ❤️😌😴😴😴**💫🌸💫🌸";
        r_text[2] ="🚫⃟⃟⃟⃟⃟ ⃟⃟⃟⃟⚡︎➟⏤͟͟͞͞❤️ꦿ࿔*සුභ රාත්‍රියක්⃞ᴳоо🅳⃢ᴺɪɢʜ🆃💓
*🇱🇰 ❱❱❱🍃⃟✦⃝🌼᭄᭄᭄̊̊̊̊̊̊࿔😯⃟💦᭄᭄̊̊̊̊࿔❱❱❱* 😈";
        r_text[3] ="🌌❡០០ᖱ 🌙⩎ɨ❡ϦƬ 🌎";
        r_text[4] ="😘ցօօժ ⭐️ղíցհԵ 💝";
        r_text[5] ="🌃Ꮐᝪᝪᗞ 🙈ᑎᏆᏀᕼᎢ 💫✨";

      
    
        var i = Math.floor(6*Math.random())
    
        await message.client.sendMessage(
            message.jid,(r_text[i]), MessageType.text);
    
        }));    

    }
    

    if (Config.WORKTYPE == 'public') {
        Badboy.addCommand({pattern: 'gm', fromMe: false, deleteCommand: true, desc: GM,}, (async (message, match) => {
        
            var r_text = new Array ();
        
            r_text[1] = "☞⍤───★᭄✮͚🙊─⃤̸᭄̂̇✾̋ ⍤⃝☘️😘●͙͙͙͙͙͙█❁ཻ͜͡❀͙͙͙͙͙͙͙͙͙͙͝ ᭄ ❥᭄⃞⃝⃟⃟⃞⃝★────✌️☺️✦⃟🍀⃝🍏⃤💙⃝ꪶ➤ཻ⃝⃘̉̉̉̉̉̉⃝★᭄❥͜͡⃝ᶫᵒᵛᵉ⃝➤⃟̱̱̱̱̄̄̄̄😊
*ගුම්මෝනිම්❁͜͡❁ཻ͜͡😋💝☞🥺➳̶☞̱̱̱̱̱̱̱̱̱̄̄̄̄̄̄̄̄̄̄̄➸⃟̗̗̗̗̗̗̗̗̗̗̗̗̀̀̀̀̀̀̀̀̀̀̀̀̀⃟ ⃟❖❁⃝❤️➸⃟̗̗̗̗̗̗̗̗̗̗̗̗̗̗̀̀̀̀̀̀̀̀̀̀̀̀̀❁͡ මැනික●͙ල"හ්᭄●͙͙͙͙͙❁⃝➸⃟̗̗̗̗̗̗̗̗̗̗̗̗̗̗̀̀̀̀̀̀̀̀̀̀̀̀̀❁ཻ͜͡  බුදුසරණයිꗶ❥ ⃝⃘η̶̩̥̩̥̩̥̩̥̩̥̩̥̩̥̩͓̩̬🌸─⃝►ꗶ❥ ⃝⃘η̶̩̥̩̥̩̥̩̥̩̥̩̥̩̥̩͓̩̬🌸─⃝»͓̽☞̱̱̱̱̱̱̱̱̱̄̄̄̄̄̄̄̄̄̄̄➸⃟̗̗̗̗̗̗̗̗̗̗̀̀̀̀̀̀̀̀̀̀̀̀̀ දෙව්පිහිටයිꗶ❥ ⃝⃘η̶̩̥̩̥̩̥̩̥̩̥̩̥̩̥̩͓̩̬🌸─⃝►ꗶ❥ ⃝⃘η̶̩̥̩̥̩̥̩̥̩̥̩̥̩̥̩͓̩̬🌸─⃝»͓̽☞̱̱̱̱̱̱̱̱̱̄̄̄̄̄̄̄̄̄̄̄➸⃟̗̗̗̗̗̗̗̗̗̗̗̗̀̀̀̀̀̀̀̀̀̀̀̀̀⃟ ⃟❖❁⃝➸⃟̗̗̗̗̗̗̗̗̗̗̗̗̗̗̀̀̀̀̀̀̀̀̀̀̀̀̀❁͜͡🙏😘 සම්මාසම්බුදු❁ཻ͜͡සරනයි😋💝☞
";
            r_text[2] ="💫🌸💫🌸🅶🅾🅾🅳 🅼🅾🆁🅽🅸🅽🅶🌹⃝✥⃟☺️᭄ꦿ *ගුඩ් මොනිම̸්̿̿͐❤̻̻̻̻̻̻̻̻̻͐͐͐̿̿̿̿༄༹༹༹༴༴⃟⃫͎͎͎͎͎͎͇͇͇͇͇͇͇̳̳̳̿̿̿̿̿̿❤️⃟✦⃝̮̮̮̯̯̯😌 සුභ උදෑසනක්❤️⃟⃟◍̸̸̸̸̣̣̣❀❤̐̐̐̐̐⇝⃟̗̗̗̗̗̗̗̗̗̗̖̖̋̋̋̋̋̋̋̋̋̋̋̏̏💔̩̩̭̭̭̭̭බුදු සරණයි🙃⃝⃟۝᭄̊̊࿔࿓ තෙරුවන් සරණයි🍃⃟✦⃝🌼᭄᭄᭄̊̊̊̊̊̊࿔";
            r_text[3] ="🍃𝙶𝚘𝚘𝚍 🌻𝚖𝚘𝚛𝚗𝚒𝚗𝚐 🥰";
            r_text[4] ="🍀𝗚𝗼𝗼𝗱 😘𝗺𝗼𝗿𝗻𝗶𝗻𝗴 🌸";
            r_text[5] ="🌻𝓖𝓸𝓸𝓭 𝓶𝓸𝓻𝓷𝓲𝓷𝓰 💞";
            r_text[6] ="🌼🅖🅞🅞🅓 🅜🅞🅡🅝🅘🅝🅖 🐶";
            r_text[7] ="🍃Ⓖⓞⓞⓓ 🌈ⓜⓞⓡⓝⓘⓝⓖ 🥰";
          
        
            var i = Math.floor(8*Math.random())
        
            await message.client.sendMessage(
                message.jid,(r_text[i]), MessageType.text);
        
            }));
        
        
        Badboy.addCommand({pattern: 'gn', fromMe: false, deleteCommand: true, desc: GN,}, (async (message, match) => {
        
                var r_text = new Array ();
            
                r_text[1] = "🥺➳̶☞̱̱̱̱̱̱̱̱̱̄̄̄̄̄̄̄̄̄̄̄➸⃟̗̗̗̗̗̗̗̗̗̗̗̗̀̀̀̀̀̀̀̀̀̀̀̀̀⃟ ⃟❖❁⃝❤️➸⃟̗̗̗̗̀̀̀̀̀̀̀̀̀̀̀̀̀ ❤̋҉̋⃢**➸⃟̗̗̗̗̗̗̗̗̗̗̗̗̗̗̀̀̀̀̀̀̀̀̀̀̀̀̀🌺⍤⃝───ගුඩ් නයිට්✺⃘̶̶۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟̊̊̊̊̊̊͜͡?❥⃢❀͙͙͙͙͙͙͙̽̽̽̽̽̽̽̽᳑̽☢︎︎༒︎✺⃘̶̶۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟̊̊̊̊̊̊͜͡ ~      බුදු සරනයි🙏🙏🙏🙏🌺 පරිස්සමින් ❤️ ◎⃝»̶̶͓͓͓̽̽̽❁͜͡❁ཻ͜͡💝☞ඉන්න➳̶☞̱̱̱̱̱̱̱̱̱̄̄̄̄̄̄̄̄̄̄̄➸⃟̗̗̗̗̗̗̗̗̗̗̗̗̀̀̀̀̀̀̀̀̀̀̀̀̀⃟ ❤️😌😴😴😴**💫🌸💫🌸";
                r_text[2] ="🚫⃟⃟⃟⃟⃟ ⃟⃟⃟⃟⚡︎➟⏤͟͟͞͞❤️ꦿ࿔*සුභ රාත්‍රියක්⃞ᴳоо🅳⃢ᴺɪɢʜ🆃💓
*🇱🇰 ❱❱❱🍃⃟✦⃝🌼᭄᭄᭄̊̊̊̊̊̊࿔😯⃟💦᭄᭄̊̊̊̊࿔❱❱❱* 😈";
                r_text[3] ="🌌❡០០ᖱ 🌙⩎ɨ❡ϦƬ 🌎";
                r_text[4] ="😘ցօօժ ⭐️ղíցհԵ 💝";
                r_text[5] ="🌃Ꮐᝪᝪᗞ 🙈ᑎᏆᏀᕼᎢ 💫✨";
        
              
            
                var i = Math.floor(6*Math.random())
            
                await message.client.sendMessage(
                    message.jid,(r_text[i]), MessageType.text);
            
                }));    
                Badboy.addCommand({pattern: 'gm', fromMe: true, deleteCommand: true,dontAddCommandList: true }, (async (message, match) => {
        
                    var r_text = new Array ();
                
                    r_text[1] = "☞⍤───★᭄✮͚🙊─⃤̸᭄̂̇✾̋ ⍤⃝☘️😘●͙͙͙͙͙͙█❁ཻ͜͡❀͙͙͙͙͙͙͙͙͙͙͝ ᭄ ❥᭄⃞⃝⃟⃟⃞⃝★────✌️☺️✦⃟🍀⃝🍏⃤💙⃝ꪶ➤ཻ⃝⃘̉̉̉̉̉̉⃝★᭄❥͜͡⃝ᶫᵒᵛᵉ⃝➤⃟̱̱̱̱̄̄̄̄😊
*ගුම්මෝනිම්❁͜͡❁ཻ͜͡😋💝☞🥺➳̶☞̱̱̱̱̱̱̱̱̱̄̄̄̄̄̄̄̄̄̄̄➸⃟̗̗̗̗̗̗̗̗̗̗̗̗̀̀̀̀̀̀̀̀̀̀̀̀̀⃟ ⃟❖❁⃝❤️➸⃟̗̗̗̗̗̗̗̗̗̗̗̗̗̗̀̀̀̀̀̀̀̀̀̀̀̀̀❁͡ මැනික●͙ල"හ්᭄●͙͙͙͙͙❁⃝➸⃟̗̗̗̗̗̗̗̗̗̗̗̗̗̗̀̀̀̀̀̀̀̀̀̀̀̀̀❁ཻ͜͡  බුදුසරණයිꗶ❥ ⃝⃘η̶̩̥̩̥̩̥̩̥̩̥̩̥̩̥̩͓̩̬🌸─⃝►ꗶ❥ ⃝⃘η̶̩̥̩̥̩̥̩̥̩̥̩̥̩̥̩͓̩̬🌸─⃝»͓̽☞̱̱̱̱̱̱̱̱̱̄̄̄̄̄̄̄̄̄̄̄➸⃟̗̗̗̗̗̗̗̗̗̗̀̀̀̀̀̀̀̀̀̀̀̀̀ දෙව්පිහිටයිꗶ❥ ⃝⃘η̶̩̥̩̥̩̥̩̥̩̥̩̥̩̥̩͓̩̬🌸─⃝►ꗶ❥ ⃝⃘η̶̩̥̩̥̩̥̩̥̩̥̩̥̩̥̩͓̩̬🌸─⃝»͓̽☞̱̱̱̱̱̱̱̱̱̄̄̄̄̄̄̄̄̄̄̄➸⃟̗̗̗̗̗̗̗̗̗̗̗̗̀̀̀̀̀̀̀̀̀̀̀̀̀⃟ ⃟❖❁⃝➸⃟̗̗̗̗̗̗̗̗̗̗̗̗̗̗̀̀̀̀̀̀̀̀̀̀̀̀̀❁͜͡🙏😘 සම්මාසම්බුදු❁ཻ͜͡සරනයි😋💝☞
";
                    r_text[2] ="💫🌸💫🌸🅶🅾🅾🅳 🅼🅾🆁🅽🅸🅽🅶🌹⃝✥⃟☺️᭄ꦿ *ගුඩ් මොනිම̸්̿̿͐❤̻̻̻̻̻̻̻̻̻͐͐͐̿̿̿̿༄༹༹༹༴༴⃟⃫͎͎͎͎͎͎͇͇͇͇͇͇͇̳̳̳̿̿̿̿̿̿❤️⃟✦⃝̮̮̮̯̯̯😌 සුභ උදෑසනක්❤️⃟⃟◍̸̸̸̸̣̣̣❀❤̐̐̐̐̐⇝⃟̗̗̗̗̗̗̗̗̗̗̖̖̋̋̋̋̋̋̋̋̋̋̋̏̏💔̩̩̭̭̭̭̭බුදු සරණයි🙃⃝⃟۝᭄̊̊࿔࿓ තෙරුවන් සරණයි🍃⃟✦⃝🌼᭄᭄᭄̊̊̊̊̊̊࿔";
                    r_text[3] ="🍃𝙶𝚘𝚘𝚍 🌻𝚖𝚘𝚛𝚗𝚒𝚗𝚐 🥰";
                    r_text[4] ="🍀𝗚𝗼𝗼𝗱 😘𝗺𝗼𝗿𝗻𝗶𝗻𝗴 🌸";
                    r_text[5] ="🌻𝓖𝓸𝓸𝓭 𝓶𝓸𝓻𝓷𝓲𝓷𝓰 💞";
                    r_text[6] ="🌼🅖🅞🅞🅓 🅜🅞🅡🅝🅘🅝🅖 🐶";
                    r_text[7] ="🍃Ⓖⓞⓞⓓ 🌈ⓜⓞⓡⓝⓘⓝⓖ 🥰";
                  
                
                    var i = Math.floor(8*Math.random())
                
                    await message.client.sendMessage(
                        message.jid,(r_text[i]), MessageType.text);
                
                    }));
                
                
                Badboy.addCommand({pattern: 'gn', fromMe: true, deleteCommand: true,dontAddCommandList: true }, (async (message, match) => {
                
                        var r_text = new Array ();
                    
                        r_text[1] = "🥺➳̶☞̱̱̱̱̱̱̱̱̱̄̄̄̄̄̄̄̄̄̄̄➸⃟̗̗̗̗̗̗̗̗̗̗̗̗̀̀̀̀̀̀̀̀̀̀̀̀̀⃟ ⃟❖❁⃝❤️➸⃟̗̗̗̗̀̀̀̀̀̀̀̀̀̀̀̀̀ ❤̋҉̋⃢**➸⃟̗̗̗̗̗̗̗̗̗̗̗̗̗̗̀̀̀̀̀̀̀̀̀̀̀̀̀🌺⍤⃝───ගුඩ් නයිට්✺⃘̶̶۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟̊̊̊̊̊̊͜͡?❥⃢❀͙͙͙͙͙͙͙̽̽̽̽̽̽̽̽᳑̽☢︎︎༒︎✺⃘̶̶۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟۟̊̊̊̊̊̊͜͡ ~      බුදු සරනයි🙏🙏🙏🙏🌺 පරිස්සමින් ❤️ ◎⃝»̶̶͓͓͓̽̽̽❁͜͡❁ཻ͜͡💝☞ඉන්න➳̶☞̱̱̱̱̱̱̱̱̱̄̄̄̄̄̄̄̄̄̄̄➸⃟̗̗̗̗̗̗̗̗̗̗̗̗̀̀̀̀̀̀̀̀̀̀̀̀̀⃟ ❤️😌😴😴😴**💫🌸💫🌸";
                        r_text[2] ="🚫⃟⃟⃟⃟⃟ ⃟⃟⃟⃟⚡︎➟⏤͟͟͞͞❤️ꦿ࿔*සුභ රාත්‍රියක්⃞ᴳоо🅳⃢ᴺɪɢʜ🆃💓
*🇱🇰 ❱❱❱🍃⃟✦⃝🌼᭄᭄᭄̊̊̊̊̊̊࿔😯⃟💦᭄᭄̊̊̊̊࿔❱❱❱* 😈";
                        r_text[3] ="🌌❡០០ᖱ 🌙⩎ɨ❡ϦƬ 🌎";
                        r_text[4] ="😘ցօօժ ⭐️ղíցհԵ 💝";
                        r_text[5] ="🌃Ꮐᝪᝪᗞ 🙈ᑎᏆᏀᕼᎢ 💫✨";
                
                      
                    
                        var i = Math.floor(6*Math.random())
                    
                        await message.client.sendMessage(
                            message.jid,(r_text[i]), MessageType.text);
                    
                        }));
}


